src/cf/Documents/fmBudgetsDistributionBases.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>fmBudgetsDistributionBases</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.fmBudgetsDistributionBases</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>OperationType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.fmDistributionBaseOperationTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DistributionBase</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmDistributionBases</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BalanceUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmBalanceUnits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DistributionDepartment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmDepartments</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DistributionItem</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmIncomesAndExpensesItems</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DistributionProject</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmProjects</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EndDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BudgetDistributionStep</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmBudgetDistributionSteps</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Scenario</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmBudgetingScenarios</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Bases</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Department</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.fmDepartments</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BaseValue</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Active</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Project</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.fmProjects</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Enums/fmDistributionBaseTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>fmDistributionBaseTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>DepartmentsBase</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ItemsBase</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ProjectsBase</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/fmDistributionBaseOperationTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>fmDistributionBaseOperationTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>LoadedBase</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ManualBase</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CalculatedBase</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/fmBudgetsDistributionBases/Forms/DocumentForm/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&AtServer
Function TabSectionItemsCount_Bases()
	Return Object.Bases.Count();
EndFunction

&AtServer
Procedure BaseSpecificWeightCalculation(NewCalculation = False)
	
	TotalSpecificWeight	= 0;
	MAX		= 0;
	TotalOfBase		= Object.Bases.Total("BaseValue");
	RowMax		= Undefined;
	
	For Each BaseItem In Object.Bases Do
		BaseItem.BaseSpecificWeight = ?(
			TotalOfBase <> 0,
			Round((BaseItem.BaseValue / TotalOfBase) * 100, 3),
			0);
		TotalSpecificWeight = TotalSpecificWeight + BaseItem.BaseSpecificWeight;
		If MAX = 0 Then
			MAX = BaseItem.BaseSpecificWeight
		EndIf;
		If Min(MAX, BaseItem.BaseSpecificWeight) = BaseItem.BaseSpecificWeight Then
			RowMax = BaseItem;
		EndIf;
	EndDo;
	
	Delta = ?(TotalSpecificWeight > 0, 100 - TotalSpecificWeight, 0);
	If NOT Delta = 0 Then
		RowMax.BaseSpecificWeight = RowMax.BaseSpecificWeight + Delta;
	EndIf;
	
EndProcedure

&AtServer
Function SetupVisibility()
	If DistributionBaseType=Enums.fmDistributionBaseTypes.ProjectsBase Then
		Items.BasesDepartment.Visible = False;
		Items.BasesProject.Visible = True;
		Items.DistributionDepartment.AutoChoiceIncomplete = True;
		Items.DistributionDepartment.AutoMarkIncomplete = True;
	Else
		Items.BasesDepartment.Visible = True;
		Items.BasesProject.Visible = False;
		Items.DistributionDepartment.AutoChoiceIncomplete = False;
		Items.DistributionDepartment.AutoMarkIncomplete = False;
	EndIf;
EndFunction // НастроитьВидимость()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

//Обработчик события формы "ПриСозданииНаСервере" 
//
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	DistributionBaseType = Object.DistributionBase.BaseType;
	SetupVisibility();
	BaseSpecificWeightCalculation();
	If Object.OperationType = Enums.fmDistributionBaseOperationTypes.CalculatedBase Then
		Items.BudgetDistributionStep.Visible = True;
	EndIf;
	
EndProcedure //ПриСозданииНаСервере()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&AtClient
Procedure BasesBaseValueOnChange(Item)
	BaseSpecificWeightCalculation();
EndProcedure

&AtClient
Procedure BasesOnStartEdit(Item, NewLine, Copy)
	
	If NewLine AND NOT Copy AND Item.CurrentData <> Undefined Then
		Item.CurrentData.Active = True;
	EndIf;
	
	If Copy Then
		BaseSpecificWeightCalculation(True);
	EndIf;
	
EndProcedure

&AtClient
Procedure BasesAfterDeleteRow(Item)
	BaseSpecificWeightCalculation(True);
EndProcedure

//Обработчик события при изменении базы распределения
//
&AtClient
Procedure DistributionBaseOnChange(Item)
	DistributionBaseOnChangeServer();
EndProcedure //БазаРаспределенияПриИзменении()

//Обработчик события при изменении базы распределения
//
&AtServer
Procedure DistributionBaseOnChangeServer()
	If NOT DistributionBaseType=Object.DistributionBase.BaseType Then
		Object.Bases.Clear();
		DistributionBaseType=Object.DistributionBase.BaseType;
		SetupVisibility();
	EndIf;
EndProcedure //БазаРаспределенияПриИзменении()
